### Series 데이터 개수 세기
-  count()메서드 = 개수를 세주는데~ NaN 값은 세지 않는다.  
   DataFrame에 count()메서드를 사용하면 각 열마다 데이터 개수를 세고, Series로 반환한다.  
   누락된 부분(NaN)을 찾을 때 유용하다.

In [13]:
s = pd.Series(range(10))
s[3] = np.nan
print('count : ',s.count(),'\nlen : ',len(s),end ='\n\n') # len은 길이만.
s

count :  9
len :  10

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

- 데이터 시각화 수업에 배울 seaborn 패키지에 titanic호의 승객 데이터도 있다.
- 아래 예제처럼 DataFrame으로 읽어올 수 있다.

In [14]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

# Series 카테고리 값 세기
-  Series 값이 정수, 문자열,카테고리 값인 경우에는 value_counts()메서드로
   각각의 값이 나온 횟수를 셀 수 있다.
    -  value_counts 의 인자중 normalize = True하면 상대분포로 값을 준다.

In [15]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6,size=100))
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [16]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5,size=(4,4)),dtype=float)
df.iloc[2,3] = np.nan
print(df[0].value_counts())
df

3.0    2
0.0    1
4.0    1
Name: 0, dtype: int64

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

# DataFrame 값 세기
- DataFrame에서도 value_counts 메서드가 사용 가능하고 column값을 넣어주면 된다.  
  단 column label이 있어야한다. (default로 들어가는 정수형 index의 경우 작동안함.)
- 하지만 NaN값이 있는 row는 개수로 안 친다.

In [17]:
# df.value_counts(1) # 에러나는 구문
df = pd.DataFrame(np.arange(4*4).reshape(4,4))
print(df.value_counts([0,1]))
df = pd.DataFrame(np.arange(4*4).reshape(4,4),columns=list('ABCD'))
print(df)
print(df.value_counts('A'))
print(df.value_counts(['A','B','C']))

0   1
0   1     1
4   5     1
8   9     1
12  13    1
dtype: int64
    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
A
0     1
4     1
8     1
12    1
dtype: int64
A   B   C
0   1   2     1
4   5   6     1
8   9   10    1
12  13  14    1
dtype: int64

### Series 정렬 
- index 기준 = sort_index()
- value 기준 = sort_values() - NaN값이 있을 떄 NaN값이 가장 뒤에 위치하게 됨.
- 큰수에서 작은수로 가는 내림차순으로 변경하기 위해 사용하는 인자는 ascending = False 이다.
- ascending = False 를 해도 NaN은 가장 뒤에 온다.

In [65]:
print(s2.value_counts())

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [67]:
print(s2.value_counts().sort_index())

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

In [66]:
print(s2.value_counts().sort_values())

2    13
3    14
5    16
4    17
0    18
1    22
dtype: int64

### Data Frame정렬 
- DataFrame에서 sort_values 매서드를 사용하려면 by 키워드 인수를 
  활용하여 DataFrame의 정렬 기준이 되는 column을 지정해 주어야 한다.
- by키워드 값으로 여러개를 넣어주면 각 1번쨰 기준으로 정렬 후 다음에 오는놈 기준으로 정렬한다.

In [70]:
print(df)
df.sort_values

0     5
1     3
2     4
3     0
4     1
     ..
95    4
96    5
97    2
98    4
99    3
Length: 100, dtype: int32

<bound method Series.sort_values of 0     5
1     3
2     4
3     0
4     1
     ..
95    4
96    5
97    2
98    4
99    3
Length: 100, dtype: int32>

In [ ]:
print(df.sort_values(by=1)) # 기준열을 기준으로 row단위로 정렬된다.

TypeError: sort_values() got an unexpected keyword argument 'by'

In [68]:
print(df.sort_values(by=[1,2]))

KeyError: 1

In [75]:
print(titanic['sex'].value_counts())

male      577
female    314
Name: sex, dtype: int64

In [76]:
print(titanic['age'].value_counts().sort_values(ascending= False))

29.00    197
24.00     30
22.00     27
18.00     26
30.00     25
        ...
66.00      1
0.67       1
0.42       1
34.50      1
74.00      1
Name: age, Length: 88, dtype: int64

In [77]:
print(titanic['class'].value_counts())

Third     491
First     216
Second    184
Name: class, dtype: int64

In [78]:
print(titanic['alive'].value_counts())

no     549
yes    342
Name: alive, dtype: int64

### DataFrame 행/열 합계
- sum(axis) 
- axis 인수에는 합계로 인해 없어지는 방향축(0=row , 1 = column) 을 지정한다.
- row의 집계를 구할 때는 sum(axis=1) 메서드를 사용합니다. 
- 그냥 sum() 은 axis=0일때 값을 구한다.

### DataFrame 행/열 평균
- sum과 사용법이 같은 mean()메서드를 사용하면 된다.

In [80]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10 ,size = (4,8)))
print(df2)

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [82]:
print(df2.sum(axis=1))
df2['Rowsum'] = df2.sum(axis=1)

0    35
1    34
2    41
3    42
dtype: int64

In [83]:
print(df2)
df2.loc['ColTotal2'] = df2.sum()

   0  1  2  3  4  5  6  7  Rowsum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

In [84]:
df2

            0   1   2   3   4   5  6   7  Rowsum
0           5   8   9   5   0   0  1   7      35
1           6   9   2   4   5   2  4   2      34
2           4   7   7   9   1   7  0   6      41
3           9   9   7   6   9   1  0   1      42
ColTotal2  24  33  25  24  15  10  5  16     152

In [85]:
del df2[7]
df2.loc['ColTotal'] = df2.mean()
df2

              0     1     2     3     4     5    6  Rowsum
0           5.0   8.0   9.0   5.0   0.0   0.0  1.0    35.0
1           6.0   9.0   2.0   4.0   5.0   2.0  4.0    34.0
2           4.0   7.0   7.0   9.0   1.0   7.0  0.0    41.0
3           9.0   9.0   7.0   6.0   9.0   1.0  0.0    42.0
ColTotal2  24.0  33.0  25.0  24.0  15.0  10.0  5.0   152.0
ColTotal    9.6  13.2  10.0   9.6   6.0   4.0  2.0    60.8

In [24]:
#연습문제1
titanic.loc[titanic.pclass ==1]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
23,1,1,male,28.0,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [25]:
# 연습문제 2
round(titanic['age'].mean(),1) # 나이평균구하기

29.7

In [26]:
#연습문제3
female_age_mean = titanic[titanic.sex =='female']['age'].mean() # 여자 나이평균 구하기
round(female_age_mean,1)

27.9

In [27]:
# 연습문제4
#여자 이고, pclass가 1인 사람들의 나이 평균 구하기
#내코드
pclass = titanic[titanic.pclass == 1]
round(pclass[pclass.sex=='female']['age'].mean(),1)
#선생님 코드 
round(titanic[(titanic['pclass']==1) & (titanic['sex'] == 'female')]['age'].mean(),1)
# True False bool type 을 구하는 연산들에 대해 &연산을 추가해 조건들을 중첩해 줄 수 있다.
#zeus 코드
titanic.loc[titanic.pclass == 1].loc[titanic.sex == "female"]["age"].mean()

34.61176470588235

### DataFrame apply() 메서드
- 함수를 모든 값에 적용하는 함수
- 첫인자로 함수를 필수 값으로 받는다
- 경우에 따라서 두 번째 인자로 axis를 받는다.
    - axis default=  0
    - axis = 0 or 'index' 이면 각column에 적용된다.
    - axis = 1 or 'comuns' 이면 각 row에 적용된다.

In [28]:
import pandas as pd
df = pd.DataFrame([[4,9]]*3, columns=['A','B'])
df

   A  B
0  4  9
1  4  9
2  4  9

In [86]:
print(df.apply(np.sqrt))
np.sqrt(df) # 둘은 같은 값이다.

       col1      col2
0  1.000000  1.732051
1  1.414214  2.000000

       col1      col2
0  1.000000  1.732051
1  1.414214  2.000000

In [92]:
print(df)
#axis가 0 일때 각 column 별 집계한다.
df.apply(np.sum, axis=0)

   col1  col2
0     1     3
1     2     4

col1    3
col2    7
dtype: int64

In [89]:
#axis가 1 일떄 각 row 별 집계한다.
df.apply(np.sum,axis=1)

0    4
1    6
dtype: int64

- 함수의 return이 column마다 리스트를 반환하면 DataFrame의 결과를 얻을 수 있다.
- 함수의 return이 row마다 리스트를 반환하면 각 row마다 리스트를 하나의 값으로 취급하는 Series 타입의 결과가 나온다
- result_type = 'expand' 을 설정하면 DataFrame 타입으로 묶어서 나올 수 있다.
- result_Type = 'broadcast' 를 인수로 전달하면 동일한 shape의 결과를 보장한다.   
  - 함수로부터 반환되는 게 리스트인지 스칼라인지에 상관없이 axis방향으로 브로드캐스트한다.  
  - 결과의 column label은 본래의 것을 유지한다.  
  - broadcast를 인수로 전달할 때 함수로부터 return된 값이 기존 shape으로 broadcast할 수 없는 shape이라면   
    ValueError가 발생한다.

In [94]:
print(df.apply(lambda x: [1,2], axis=0)) # DataFrame타입의 결과

   col1  col2
0     1     1
1     2     2

In [95]:
print(df.apply(lambda x : [1,2],axis=1)) # Series타입의 결과

0    [1, 2]
1    [1, 2]
dtype: object

In [96]:
print(df.apply(lambda x: [1,2],axis=1,result_type='expand'))

   0  1
0  1  2
1  1  2

In [97]:
print(df.apply(lambda x : [1,2],axis=1,result_type = 'broadcast'))

   col1  col2
0     1     2
1     1     2

### column마다의 최대값과 최소값의 차이를 구하고 싶으면 다음과 같은 람다 사용

In [98]:
df3 = pd.DataFrame({
    'A' : [1,2,3,4,3],
    'B' : [1,6,5,4,3],
    'C' : [1,5,2,4,4]
    
})
df3

   A  B  C
0  1  1  1
1  2  6  5
2  3  5  2
3  4  4  4
4  3  3  4

In [99]:
print(df3.apply(lambda x:x.max()-x.min()))

A    3
B    5
C    4
dtype: int64

In [100]:
print(df3.apply(lambda x:x.max()-x.min(),axis=1))

0    0
1    4
2    3
3    0
4    1
dtype: int64

In [104]:
print(df3.apply(pd.value_counts)) # 개수 파악하는 함수

     A    B    C
1  1.0  1.0  1.0
2  1.0  NaN  1.0
3  2.0  1.0  NaN
4  1.0  1.0  2.0
5  NaN  1.0  1.0
6  NaN  1.0  NaN

In [252]:
#연습문제1
titanic['adult/child'] = titanic.apply(lambda r : 'adult' if r.age>=20 else "child",axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [34]:
연습문제2
titanic['category1'] = titanic.apply(lambda r : r.sex if r.age>20 else 'child',axis=1)
titanic.tail(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
881,0,3,male,33.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True,adult,male
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True,adult,female
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True,adult,male
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True,adult,male
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False,adult,female
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,child
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult,male

### DataFrame fillna() 메서드
- fillna() 메서드는 NaN값을 원하는 값으로 바꿀 수 있다. 첫 인자로 변경하고자 하는 값을 전달하면 된다.
- value값으로 column label 을 key로 갖는 딕셔너리를 전달하여 column마다 NaN을 대치하는 값을 각각 설정가능.
- limit 키워드 인자에 숫자를 전달하여 그 숫자만큼 column마다 변경 횟수를 제한 할 수 있다.
- DataFrame을 value로 전달해서 NaN값을 대체할 수 있습니다. 다만 column label과 row index가 일치하지 않으면 적용되지 않는다.

In [107]:
# np.nan 으로 NaN값 만들 수 있음.
df = pd.DataFrame([[np.nan,2,np.nan,0],
                  [3,4,np.nan,1],
                  [np.nan,np.nan,np.nan,np.nan],
                  [np.nan,3,np.nan,4]], columns = list('ABCD'))
print(df)
print(df.fillna(0))

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0
     A    B    C    D
0  0.0  2.0  0.0  0.0
1  3.0  4.0  0.0  1.0
2  0.0  0.0  0.0  0.0
3  0.0  3.0  0.0  4.0

In [108]:
values = {'A':0,'B' :1,'C':2,'D':3} #column마다 원하는 값으로 NaN값을 채울 수 있다.
df.fillna(value=values)

     A    B    C    D
0  0.0  2.0  2.0  0.0
1  3.0  4.0  2.0  1.0
2  0.0  1.0  2.0  3.0
3  0.0  3.0  2.0  4.0

In [109]:
df.fillna(value=values,limit=2) # column마다 2회씩만 변경가능.

     A    B    C    D
0  0.0  2.0  2.0  0.0
1  3.0  4.0  2.0  1.0
2  0.0  1.0  NaN  3.0
3  NaN  3.0  NaN  4.0

In [110]:
df2 = pd.DataFrame(np.zeros((3,4)),columns = list('ABCㅎ')) # column도 ㅎ column이 D와 일치하지 않아서 NaN이 남아있음.
df.fillna(df2)                                              # row도 한줄 짧아서 마지막 row는 NaN이 그대로 남아있음

     A    B    C    D
0  0.0  2.0  0.0  0.0
1  3.0  4.0  0.0  1.0
2  0.0  0.0  0.0  NaN
3  NaN  3.0  NaN  4.0

In [39]:
#연습문제1
avg_age = int(titanic['age'].mean()) # 평균값 구함

titanic['age'] = titanic['age'].fillna(avg_age) # fillna에 inplace=True를 넣어주면 할당하지 않고도 알아서 바뀐값이 저장됨.
# print(titanic[titanic['age'].isna()])# age에 NaN값이 없음을 볼 수 있음\
titanic.head(15)
titanic.count()

survived       891
pclass         891
sex            891
age            891
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
adult/child    891
category1      891
dtype: int64

### DataFrame astype() 메서드
- column의 자료형을 변경하는 메서드

In [40]:
d = {'col1' : [1,2], 'col2' : [3,4]}
df = pd.DataFrame(data=d)
df.dtypes

col1    int64
col2    int64
dtype: object

In [41]:
df.astype('int32').dtypes

col1    int32
col2    int32
dtype: object

In [42]:
df.astype({'col1': 'int32'}).dtypes # dictionary로 지정하여 하나씩 타입변경 가능

col1    int32
col2    int64
dtype: object

In [43]:
titanic['category2'] = titanic['sex'] + titanic['age'].astype('str')

In [44]:
titanic[['age','category2']]

      age   category2
0    22.0    male22.0
1    38.0  female38.0
2    26.0  female26.0
3    35.0  female35.0
4    35.0    male35.0
..    ...         ...
886  27.0    male27.0
887  19.0  female19.0
888  29.0  female29.0
889  26.0    male26.0
890  32.0    male32.0

[891 rows x 2 columns]

### DataFrame 실수 값을 카테고리 값으로 변환
- 실수 값을 크기 기준으로 하여 카테고리 값으로 변환하고 싶을 떄는 다음과 같은 명령을 사용합니다.
- cut : 실수 값의 경계선을 지정하는 경우 - 범위단위로 끊을때 유리
    - x = 1차원 형태의 배열 형태가 옵니다.
    - bins = int, 스칼라를 요소로 갖는 시퀀스가 옵니다.
- qcut : 개수가 똑같은 구간으로 나누는 경우(분위수) - 개수단위로 끊을때 유리
    - x = id ndarray 호은 Series
    - q = int 혹은 분위수를 나타내는 1.이하의 실수를 요소로 갖는 list (ex.[0, .25 , .5 , .75, 1.])

In [45]:
ages = [0,2,10,21,23,37,31,61,20,41,32,90,101]
bins = [1,20,30,50,70,100]
label = ['미성년자','청년','장년','중년','노년']
cats = pd.cut(ages,bins,labels = label)
cats      #구간내에 없다면 NaN값이 들어간다.

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '미성년자', '장년', '장년', '노년', NaN]
Length: 13
Categories (5, object): ['미성년자' < '청년' < '장년' < '중년' < '노년']

In [46]:
print(type(cats)) # cut 명령이 반환하는 값은 categorical type이다.
                  # 속성으로 label 문자열을 codes 속성으로 정수로 인코딩한 카테고리 값을 가집니다.
print(cats.categories)
print(cats.codes) # 없으면 -1로 반환함.

<class 'pandas.core.arrays.categorical.Categorical'>
Index(['미성년자', '청년', '장년', '중년', '노년'], dtype='object')
[-1  0  0  1  1  2  2  3  0  2  2  4 -1]

In [115]:
df4 = pd.DataFrame(ages,columns = ['ages'])
df4['age_cat'] = pd.cut(df4.ages,bins,labels=label)
print(df4.dtypes)        # category 데이터는 문자열 취급이 안된다.(object type임)

ages          int64
age_cat    category
dtype: object

In [116]:
df4['age_cat'].astype(str) + df4['ages'].astype(str)# 문자열로 쓰기 위해서는 astype해주는 과정이 필요함.
print(df4.dtypes)

ages          int64
age_cat    category
dtype: object

In [111]:
df4

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      장년
6     31      장년
7     61      중년
8     20    미성년자
9     41      장년
10    32      장년
11    90      노년
12   101     NaN

In [48]:
# qcut은 원하는 개수만큼 여기서는 4개 구간으로 나누어
data = np.random.randn(1000)
cats = pd.qcut(data, 4 , labels=['Q1','Q2','Q3','Q4'])
print(pd.value_counts(cats)) #같은 개수로 나누어 짐을 알 수 있다.
cats

Q1    250
Q2    250
Q3    250
Q4    250
dtype: int64

['Q2', 'Q1', 'Q2', 'Q3', 'Q1', ..., 'Q1', 'Q1', 'Q4', 'Q4', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [49]:
bins = [0,20,30,50,70,100]
labels = ["미성년자", "청년", "장년", "중년", "노년"]
cuts = pd.cut(titanic['age'],bins,labels = label)
sorted_value_count = pd.value_counts(cuts).sort_index()
print(sorted_value_count)
sorted_value_count / sum(sorted_value_count)

미성년자    179
청년      407
장년      241
중년       59
노년        5
Name: age, dtype: int64

미성년자    0.200898
청년      0.456790
장년      0.270483
중년      0.066218
노년      0.005612
Name: age, dtype: float64

In [50]:
# 못푼문제
bins = [0,20,30,50,70,100]
labels = ["미성년자", "청년", "장년", "중년", "노년"]
cuts = pd.cut(titanic['age'],bins,labels = label)
titanic['age'] = titanic['age' & titanic[cuts != '미성년자']
titanic['category3'] = titanic.apply(lambda i : '미성년자' if i['age']<20 else i['연령층']+('남성' if i['sex']=='male' else ' 여성'),axis=1)
titanic[['연령층','age','sex','category3']]
                         
titanic[titanic['age']<1 | titanic['age']>100]

SyntaxError: invalid syntax (2159203561.py, line 6)

### DataFrame 인덱스 설정 및 제거
- set_index = 기존의 row 인덱스를 제거하고 데이터 column 중 하나를 인덱스로 설정합니다.
- reset_index =기존의 row 인덱스를 제거하고 인덱스를 데이터 열로 추가합니다.

In [117]:
import numpy as np
import pandas as pd
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list('ABCDE'), np.round(np.random.rand(3,5),2)]).T , columns = ['c1','c2','c3','c4'])
print(df1)

  c1    c2    c3    c4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [118]:
df2 = df1.set_index('c1')
print(df2)

      c2    c3    c4
c1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

In [119]:
df2.set_index('c2') # 기존의 인덱스는 사라진다.

        c3    c4
c2
0.55  0.65  0.79
0.72  0.44  0.53
0.6   0.89  0.57
0.54  0.96  0.93
0.42  0.38  0.07

- reset_index 메서드를 쓰면 보통의 자료열로 바꿀 수도 있다. 이떄 index column은 자료열의 가장 선두로 삽입됩니다.  
  DataFrame의 인덱스는 정수로 된 디폴트 인덱스로 바뀝니다.
  - 인수중에 drop = True로 인수를 전달하면 인덱스 column을 보통의 자료열로 올리는 것이 아니라 그냥 버리게 된다.

In [121]:
print(df2)
print(df2.reset_index())

      c2    c3    c4
c1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07
  c1    c2    c3    c4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [123]:
print(df2)
df2.reset_index(drop = True)

      c2    c3    c4
c1
A   0.55  0.65  0.79
B   0.72  0.44  0.53
C    0.6  0.89  0.57
D   0.54  0.96  0.93
E   0.42  0.38  0.07

     c2    c3    c4
0  0.55  0.65  0.79
1  0.72  0.44  0.53
2   0.6  0.89  0.57
3  0.54  0.96  0.93
4  0.42  0.38  0.07

In [53]:
score = {
    "이름":["일식", "이식", "삼식", "사식", "오식"],
    "국어":[60, 70, 90, 80, 100],
    "영어":[70, 86, 82, 88, 100],
    "수학":[65, 82, 85, 90, 100]
}
scores = pd.DataFrame(score)
scores

   이름   국어   영어   수학
0  일식   60   70   65
1  이식   70   86   82
2  삼식   90   82   85
3  사식   80   88   90
4  오식  100  100  100

### inplace = True 를 사용하여 만듬과 동시에 할당도 가능하다.

In [54]:
scores.set_index('이름',inplace = True)
scores

     국어   영어   수학
이름
일식   60   70   65
이식   70   86   82
삼식   90   82   85
사식   80   88   90
오식  100  100  100

In [55]:
scores.reset_index(inplace = True)
scores

   이름   국어   영어   수학
0  일식   60   70   65
1  이식   70   86   82
2  삼식   90   82   85
3  사식   80   88   90
4  오식  100  100  100

### DataFrame 다중 인덱스
- row나 column에 여러 계층을 가지는 인덱스 즉, 다중 인덱스를 설정할 수도 있습니다.
- DataFrame을 생성할 때 columns 인수에 당므 예제처럼 리스트의 리스트(행렬) 형태로 인덱스를 넣으면 다중 열 인덱스를 가지게 된다.
- 이름을 지정하면 더 편리하게 사용할 수 있습니다. column 인덱스들의 이름 지정은 columns 객체의 names 속성에 리스트를 넣어서 지정합니다.
- 다중 인덱스는 이름을 지정하면 더 편리한 사용이 가능하다. column 인덱스들의 이름 지정은 columns.names에 리스트를 넣어서 지정 가능하다.

In [125]:
np.random.seed(0)
df3 = pd.DataFrame(np.round(np.random.randn(5,4),2)
                   ,columns = [['A','A','B','B'],
                                ['C1','C2','C1','C2']])
df3

      A           B
     C1    C2    C1    C2
0  1.76  0.40  0.98  2.24
1  1.87 -0.98  0.95 -0.15
2 -0.10  0.41  0.14  1.45
3  0.76  0.12  0.44  0.33
4  1.49 -0.21  0.31 -0.85

In [126]:
df3.columns.names = ['Cidx1','Cidx2']
df3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      1.76  0.40  0.98  2.24
1      1.87 -0.98  0.95 -0.15
2     -0.10  0.41  0.14  1.45
3      0.76  0.12  0.44  0.33
4      1.49 -0.21  0.31 -0.85

In [177]:
np.random.seed(0)
df4 = pd.DataFrame(np.round(np.random.randn(6,4),2),
                    columns = [['A','A','B','B'],
                                ['C1','C2','C1','C2']],
                    index = [['M','M','M','F','F','F'],
                            ['id_' + str(i+1) for i in range(3)] * 2])
df4.columns.names = ['Cidx1','Cidx2']
df4.index.names = ['Ridx1','Ridx2']
df4

Cidx1           A           B
Cidx2          C1    C2    C1    C2
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

### DataFrame row 인덱스와 column 인덱스 교환
- stack() 메서드
    - column 인덱스를 row 인덱스로 변환해줌
- unstack() 메서드
    - row 인덱스를 column 인덱스로 변환해줌
- level 속성을 사용하여 어느 위치에 추가해줄지 결정 가능.

In [275]:
df4.stack('Cidx1') # level default값이 -1 이라서 가장 마지막에 추가된다.
df4.stack(0) # 은 위 값과 같은 결과를 가진다.

Cidx2                C1    C2
Ridx1 Ridx2 Cidx1
M     id_1  A      1.76  0.40
            B      0.98  2.24
      id_2  A      1.87 -0.98
            B      0.95 -0.15
      id_3  A     -0.10  0.41
            B      0.14  1.45
F     id_1  A      0.76  0.12
            B      0.44  0.33
      id_2  A      1.49 -0.21
            B      0.31 -0.85
      id_3  A     -2.55  0.65
            B      0.86 -0.74

In [180]:
df4.unstack('Ridx2') # Ridx2가 column에 추가됨.

Cidx1     A                                   B
Cidx2    C1                C2                C1                C2
Ridx2  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3  id_1  id_2  id_3
Ridx1
F      0.76  1.49 -2.55  0.12 -0.21  0.65  0.44  0.31  0.86  0.33 -0.85 -0.74
M      1.76  1.87 -0.10  0.40 -0.98  0.41  0.98  0.95  0.14  2.24 -0.15  1.45

### 다중 인덱스가 있는 경우의 인덱싱
- 인덱스 값이 하나의 label이나 숫자가 아니라면 ()로 둘러싸인 튜플이 되어야한다.
- loc 인덱서를 사용하는 경우에도 동일하게 튜플을 사용해서 인덱싱해야한다.

In [277]:
df3[('B','C1')]

0    0.98
1    0.95
2    0.14
3    0.44
4    0.31
Name: (B, C1), dtype: float64

In [280]:
print(df3.loc[0,('B','C1')])
df3.loc[0,('B','C1')]  = 100
df3.loc[0,('B','C1')]

0.98

100.0

In [286]:
# 단, iloc 인덱서를 사용하는 경우에는 튜플 형태의 다중인덱스를 사용할 수 없다.
print(df3.iloc[0][2])
# 만약 하나의 레벨 값만 넣으면 다중 인덱스 중에서 가장 상위의 값을 지정한 것으로 반환합니다.
df3['A']

100.0

Cidx2    C1    C2
0      1.76  0.40
1      1.87 -0.98
2     -0.10  0.41
3      0.76  0.12
4      1.49 -0.21

### DataFrame 다중 인덱스가 있는 경우의 인덱싱

In [288]:
df4

Cidx1           A           B
Cidx2          C1    C2    C1    C2
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74

In [292]:
print(df4.loc[:,('A','C1')])
df4.loc[('M','id_1'),('A','C1')]

Ridx1  Ridx2
M      id_1     1.76
       id_2     1.87
       id_3    -0.10
F      id_1     0.76
       id_2     1.49
       id_3    -2.55
Name: (A, C1), dtype: float64

1.76

In [295]:
print(df4.loc[('M','id_1'),:])
df4.loc[('All','All'),:] = df4.sum()
df4

Cidx1  Cidx2
A      C1       1.76
       C2       0.40
B      C1       0.98
       C2       2.24
Name: (M, id_1), dtype: float64

Cidx1           A           B
Cidx2          C1    C2    C1    C2
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74
All   All    6.46  0.78  7.36  4.56

### DataFrame 다중 인덱스가 있는 경우의 인덱싱
- 다중 인덱스의 튜플 내에서는 콜론(:), 즉 슬라이스 기호를 사용할 수 없고, 대신 slice(None)값을 사용해야 한다.

In [308]:
print(df4.loc[('M'),:])
df4.loc[('M',slice(None)),:]

Cidx1     A           B
Cidx2    C1    C2    C1    C2
Ridx2
id_1   1.76  0.40  0.98  2.24
id_2   1.87 -0.98  0.95 -0.15
id_3  -0.10  0.41  0.14  1.45

Cidx1           A           B
Cidx2          C1    C2    C1    C2
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45

### 다중 인덱스의 인덱스 순서 교환
- swaplevel(i,j,axis)
- i, j 는 교환하고자 하는 인덱스 label 이고, 
- axis는 0일때 row 인덱스, 1일때 column인덱스를 뜻한다. default값은 0임

In [311]:
df6 = df4.swaplevel('Cidx1','Cidx2',1)
df6

Cidx2          C1    C2    C1    C2
Cidx1           A     A     B     B
Ridx1 Ridx2
M     id_1   1.76  0.40  0.98  2.24
      id_2   1.87 -0.98  0.95 -0.15
      id_3  -0.10  0.41  0.14  1.45
F     id_1   0.76  0.12  0.44  0.33
      id_2   1.49 -0.21  0.31 -0.85
      id_3  -2.55  0.65  0.86 -0.74
All   All    6.46  0.78  7.36  4.56

In [312]:
df5 = df4.swaplevel('Ridx1','Ridx2')
df5

Cidx1           A           B
Cidx2          C1    C2    C1    C2
Ridx2 Ridx1
id_1  M      1.76  0.40  0.98  2.24
id_2  M      1.87 -0.98  0.95 -0.15
id_3  M     -0.10  0.41  0.14  1.45
id_1  F      0.76  0.12  0.44  0.33
id_2  F      1.49 -0.21  0.31 -0.85
id_3  F     -2.55  0.65  0.86 -0.74
All   All    6.46  0.78  7.36  4.56

### DataFrame 다중 인덱스가 있는 경우의 정렬
- 다중 인덱스가 있는 DF를 sort_index로 정렬할 때는 level인수를 사용하여
  어떤 인덱스를 기준으로 정렬하는지 알려줘야한다.

In [315]:
print(df5.sort_index(level=0))
df6.sort_index(axis = 1,level = 0)

Cidx1           A           B
Cidx2          C1    C2    C1    C2
Ridx2 Ridx1
All   All    6.46  0.78  7.36  4.56
id_1  F      0.76  0.12  0.44  0.33
      M      1.76  0.40  0.98  2.24
id_2  F      1.49 -0.21  0.31 -0.85
      M      1.87 -0.98  0.95 -0.15
id_3  F     -2.55  0.65  0.86 -0.74
      M     -0.10  0.41  0.14  1.45

Cidx2          C1          C2
Cidx1           A     B     A     B
Ridx1 Ridx2
M     id_1   1.76  0.98  0.40  2.24
      id_2   1.87  0.95 -0.98 -0.15
      id_3  -0.10  0.14  0.41  1.45
F     id_1   0.76  0.44  0.12  0.33
      id_2   1.49  0.31 -0.21 -0.85
      id_3  -2.55  0.86  0.65 -0.74
All   All    6.46  7.36  0.78  4.56

### DataFrame merge() SQL과 비슷한 부분이 많음.
- merge함수는 key를 기준으로 두 데이터 프레임의 공통 column 혹은 인덱스를 기준으로 두 개의 테이블을 합친다.  
  이 때 기준이 되는 column, row의 데이터를 key라고 한다.

In [131]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df1

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [132]:
df2 = pd.DataFrame({
    '고객번호' : [1001,1001,1005,1006,1008,1001], # 고객번호가 key인데 중복되는 값이 있음.
    '금액' : [10000,20000,15000,5000,100000,30000]
},columns = ['고객번호','금액'])
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [133]:
pd.merge(df1,df2) # innder join= 공통 column인 고객번호 column을 기준으로 데이터를 찾아서 합친다.
                  # 양쪽 DataFrame에 모두 키가 존재하는 데이터만 보여주는 inner join방식을 사용한다.

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

### merge 추가 속성
1. how = 'outer'  => outer join 방식은 키 값이 한쪽에만 있어도 데이터를 보여준다.
2. how = 'left'   => 첫번째 인수 기준으로 DataFrame의 키 값을 모두 보여준다.
3. how = 'right'  => 두번째 인수 기준으로 DataFrame의 키 값을 모두 보여준다.

In [134]:
pd.merge(df1,df2,how='outer')

   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0

In [62]:
pd.merge(df1,df2,how='left')

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [136]:
pd.merge(df1,df2,how='right')

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1005   희동   15000
3  1006  마이콜    5000
4  1008  NaN  100000
5  1001   둘리   30000

In [64]:
df2.value_counts()
df2.count()

고객번호    6
금액      6
dtype: int64

In [143]:
df1 = pd.DataFrame({
    '품종' : ['setosa','setosa','virginica','virginica'],
    '꽃잎길이' : [1.4,1.3,1.5,1.3]},
    columns = ['품종','꽃잎길이'])
df1

          품종  꽃잎길이
0     setosa   1.4
1     setosa   1.3
2  virginica   1.5
3  virginica   1.3

In [146]:
df2 = pd.DataFrame({
    '품종' : ['setosa','virginica','virginica','versicolor'],
    '꽃잎너비' : [0.4,0.3,0.5,0.3]},
    columns = ['품종','꽃잎너비'])
df2

           품종  꽃잎너비
0      setosa   0.4
1   virginica   0.3
2   virginica   0.5
3  versicolor   0.3

In [147]:
pd.merge(df1,df2)

          품종  꽃잎길이  꽃잎너비
0     setosa   1.4   0.4
1     setosa   1.3   0.4
2  virginica   1.5   0.3
3  virginica   1.5   0.5
4  virginica   1.3   0.3
5  virginica   1.3   0.5

### DataFrame 시계열 자료 다루기 
- 인덱스가 날짜 혹은 시간인 데이터를 말한다.
- Datetimeindex 인덱스는 아래 두 보조 함수를 사용하여 생성한다
    - pd.to_datetime 함수
    - pd.date_range 함수

In [149]:
# pd.to datetime 함수를 쓰면 날짜/ 시간을 나타내는 문자열을 자동으로 datetime 자료형으로 바꾼 후 DatetimeIndex 자료형 인덱스를 생성한다.
date_str = ['2018, 1, 1','2018, 1, 1','2018, 1, 5', '2018, 1, 6']
idx = pd.to_datetime(date_str)
idx

DatetimeIndex(['2018-01-01', '2018-01-01', '2018-01-05', '2018-01-06'], dtype='datetime64[ns]', freq=None)

In [150]:
#만들어진 시계열 인덱스를 사용하여 Series나 DataFrame을 생성한다.
np.random.seed(0)
s = pd.Series(np.random.randn(4),index = idx)
s

2018-01-01    1.764052
2018-01-01    0.400157
2018-01-05    0.978738
2018-01-06    2.240893
dtype: float64

In [152]:
# date_range 함수로 모든 날짜/ 시간을 일일이 입력할 필요 없이 시작일과 종료일을 입력하여 범위 내의 인덱스를 생성해준다.
pd.date_range('2018-4-1','2018-4-30')

DatetimeIndex(['2018-04-01', '2018-04-02', '2018-04-03', '2018-04-04',
               '2018-04-05', '2018-04-06', '2018-04-07', '2018-04-08',
               '2018-04-09', '2018-04-10', '2018-04-11', '2018-04-12',
               '2018-04-13', '2018-04-14', '2018-04-15', '2018-04-16',
               '2018-04-17', '2018-04-18', '2018-04-19', '2018-04-20',
               '2018-04-21', '2018-04-22', '2018-04-23', '2018-04-24',
               '2018-04-25', '2018-04-26', '2018-04-27', '2018-04-28',
               '2018-04-29', '2018-04-30'],
              dtype='datetime64[ns]', freq='D')

In [153]:
# 또는 시작일과 기간을 입력하여 범위 내의 인덱스를 생성해준다.
pd.date_range(start = '2018-4-1',periods=30)

DatetimeIndex(['2018-04-01', '2018-04-02', '2018-04-03', '2018-04-04',
               '2018-04-05', '2018-04-06', '2018-04-07', '2018-04-08',
               '2018-04-09', '2018-04-10', '2018-04-11', '2018-04-12',
               '2018-04-13', '2018-04-14', '2018-04-15', '2018-04-16',
               '2018-04-17', '2018-04-18', '2018-04-19', '2018-04-20',
               '2018-04-21', '2018-04-22', '2018-04-23', '2018-04-24',
               '2018-04-25', '2018-04-26', '2018-04-27', '2018-04-28',
               '2018-04-29', '2018-04-30'],
              dtype='datetime64[ns]', freq='D')

### freq 인수로 특정한 날짜만 생성되도록 한다
- s: 초
- T: 분
- H: 시간
- D: 일(day)
- B: 주말이 아닌 평일
- W: 주(일요일)
- W-MON: 주(월요일)
- M: 각 달(month)의 마지막 날
- MS: 각 달의 첫날
- BM: 주말이 아닌 평일 중에서 각 달의 마지막 날
- BMS: 주말이 아닌 평일 중에서 각 달의 첫날
- WOM-2THU: 각 달의 두번째 목요일
- Q-JAN: 각 분기의 첫달의 마지막 날
- Q-DEC: 각 분기의 마지막 달의 마지막 날

In [154]:
pd.date_range('2018-4-1','2018-4-30',freq ='B')

DatetimeIndex(['2018-04-02', '2018-04-03', '2018-04-04', '2018-04-05',
               '2018-04-06', '2018-04-09', '2018-04-10', '2018-04-11',
               '2018-04-12', '2018-04-13', '2018-04-16', '2018-04-17',
               '2018-04-18', '2018-04-19', '2018-04-20', '2018-04-23',
               '2018-04-24', '2018-04-25', '2018-04-26', '2018-04-27',
               '2018-04-30'],
              dtype='datetime64[ns]', freq='B')

In [155]:
pd.date_range('2018-4-1','2018-4-30',freq ='W')

DatetimeIndex(['2018-04-01', '2018-04-08', '2018-04-15', '2018-04-22',
               '2018-04-29'],
              dtype='datetime64[ns]', freq='W-SUN')

In [157]:
pd.date_range('2018-4-1','2018-4-30',freq ='W-Mon')

DatetimeIndex(['2018-04-02', '2018-04-09', '2018-04-16', '2018-04-23',
               '2018-04-30'],
              dtype='datetime64[ns]', freq='W-MON')

In [156]:
pd.date_range('2018-4-1','2018-4-30',freq ='MS')

DatetimeIndex(['2018-04-01'], dtype='datetime64[ns]', freq='MS')

### 추가적인 속성 shift
- 시계열 데이터의 인덱스는 시간이나 날짜를 나타내기 때문에 날짜 이동 등의 다양한 연산이 가능하다 
- shift연산을 사용하여 인덱스는 그대로 두고 데이터만 이동하는 것도 가능하다

In [158]:
np.random.seed(0)
ts = pd.Series(np.random.randn(4),index = pd.date_range('2018-1-1',periods=4,freq='M'))
ts

2018-01-31    1.764052
2018-02-28    0.400157
2018-03-31    0.978738
2018-04-30    2.240893
Freq: M, dtype: float64

In [160]:
ts.shift(1) # 인덱스는 변하지 않고 하루씩 데이터가 밀린것을 볼 수 있다. , 첫값은 알 수 없으니 NaN으로 표기된다.

2018-01-31         NaN
2018-02-28    1.764052
2018-03-31    0.400157
2018-04-30    0.978738
Freq: M, dtype: float64

In [162]:
ts.shift(-1) # 마지막 값은 알 수 없으니 NaN으로 표기된다.

2018-01-31    0.400157
2018-02-28    0.978738
2018-03-31    2.240893
2018-04-30         NaN
Freq: M, dtype: float64

In [163]:
ts.shift(1,freq = "M") # freq = '속성값' 을 사용하여 값은 그대로 두고, 인덱스만 shift하는 것이 가능하다.

2018-02-28    1.764052
2018-03-31    0.400157
2018-04-30    0.978738
2018-05-31    2.240893
Freq: M, dtype: float64

In [164]:
ts.shift(1, freq = 'W') # 동일하게 index가 shift된 예제.

2018-02-04    1.764052
2018-03-04    0.400157
2018-04-01    0.978738
2018-05-06    2.240893
dtype: float64

### 추가적인 속성 periods 와 메소드
- periods를 사용하여 값 개수 지정 가능
- year, day, month를 통해 날짜를 개별적으로 추출할 수 있다.
- weekday를 사용하여 요일에 대한 정보를 알아낼 수 있다.

In [169]:
s = pd.Series(pd.date_range('2020-12-25',periods=100, freq = 'D')) # 100개의 날짜를 day 기준으로 연속생성.
s.head(5)

0   2020-12-25
1   2020-12-26
2   2020-12-27
3   2020-12-28
4   2020-12-29
dtype: datetime64[ns]

In [170]:
s.dt.year.head(5) # month day도 존재함.

0    2020
1    2020
2    2020
3    2020
4    2020
dtype: int64

In [171]:
s.dt.weekday.head(5) # 요일에 대해 숫자로 인코딩한 결과를 알아낼 수 있다.

0    4
1    5
2    6
3    0
4    1
dtype: int64

In [174]:
s.dt.strftime('%Y년 %m월 %d일') #대소문자 구분이 있어서 y로 하면 20년만 출력되기도함.

0     2020년 12월 25일
1     2020년 12월 26일
2     2020년 12월 27일
3     2020년 12월 28일
4     2020년 12월 29일
          ...
95    2021년 03월 30일
96    2021년 03월 31일
97    2021년 04월 01일
98    2021년 04월 02일
99    2021년 04월 03일
Length: 100, dtype: object

### DataFrame 그룹 연산 메서드
- 묶음 별로 처리해서 값을 얻을 수 있도록 처리해주는 메서드
- unique한 애들을 가져오고 그놈들의 row들에 대해 뭔가를 별도로 처리하기 위해 사용

In [197]:
np.random.seed(0)
df2 = pd.DataFrame({
    'key1' : ['A','A','B','B','A'],
    'key2' : ['one','two','one','two','one'],
    'data1': [1,2,3,4,5],
    'data2': [10,20,30,40,50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [195]:
#groupby 명령을 사용하여 그룹 A와 그룹 B로 구분한 그룹 데이터를 만든다.
groups = df2.groupby(df2.key1) # key1에 대해 그룹처리해라
groups

0    one
1    two
2    one
3    two
4    one
Name: key2, dtype: object

In [187]:
# GroubBy 클래스 객체에는 각 그룹 데이터의 인덱스를 저장한 groups 속성이 존재한다
groups.groups

{'A': [0, 1, 4], 'B': [2, 3]}

In [190]:
groups.sum() # A그룹과 B그룹 데이터의 합계를 구하기 위한 그룹연산 가능

      date1  date2
key1
A         8     80
B         7     70

In [198]:
# 할당하지 않고도 사용가능하다.
#column data1에 대해서만 key1에 대해 그룹을 하고, 그룹연산하는 코드다
df2.data1.groupby(df2.key1).sum()

key1
A    8
B    7
Name: data1, dtype: int64

In [208]:
print(df2.groupby(df2.key1)['data1'].sum()) # 데이터 그룹으로 나눈 GroupBy 클래스 객체에서 합쳐도 되고,
df2.groupby(df2.key1).sum()['data1']#또는 그룹분석한 결과에서 data1만 뽑아도 된다

key1
A    8
B    7
Name: data1, dtype: int64

key1
A    8
B    7
Name: data1, dtype: int64

### 복합키 값에 따른 data1의 합계를 구하자 
- 분석하고자 하는 키가 복수이면 리스트를 사용한다.

In [207]:
df2.data1.groupby([df2.key1, df2.key2]).sum() # 각각에 대한 sum결과를 얻을 수 있다.

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64

### 그룹분석 기능을 사용하면 위의 인구 데이터로부터 지역별 합계를 구할 수도 있다.

In [211]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [214]:
df1['인구'].groupby([df1['지역'],df1['연도']]).sum().unstack('연도')

연도      2005     2010      2015
지역
경상권  3512547  3393191   3448737
수도권  9762546  9894685  12794763

### pandas 연습문제들

In [272]:
import seaborn as sns
import pandas as pd
titanic = sns.load_dataset('titanic')

In [273]:
# alive column을 booleantype으로 변경
def change_boolean(value):
    if value == 'yes':
        return True
    else: return False
titanic['alive'] = titanic['alive'].apply(change_boolean)
titanic['alive'].head(10)
#titanic['alive'] = titanic['alive'].apply(lambda k : True if k == 'yes' else False)
#titanic['alive']

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7    False
8     True
9     True
Name: alive, dtype: bool